app/controllers/sessions_controller.rb

  def show
    puts "this is the sessions #{session[:user_id]}"
    if session[:user_id]
      render :json => {user: User.find(session[:user_id]) }
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]